# num1 = int(input())
# num2 = int(input())

# if num1 < num2:
#     print(num1, 'меньше чем', num2)
# if num1 > num2:
#     print(num1, 'больше чем', num2)

# if num1 == num2:  # используем двойное равенство
#     print(num1, 'равно', num2)
# if num1 != num2:
#     print(num1, 'не равно', num2)


# .................................................................................................................................................


# pass1, pass2 = input(), input()

# if pass1 == pass2:
#     print('Пароль принят')
# else:
#     print('Пароль не принят')


# .................................................................................................................................................


# a = int(input())

# if a % 2 == 0:
#     print('Четное')
# else:
#     print('Нечетное')

# .................................................................................................................................................


# num = int(input()) # Четырех значное число

# last_digit = num % 10
# third_digit = (num // 10) % 10
# second_digit = (num // 100) % 10
# first_digit = (num // 1000) % 10

# print(last_digit, third_digit, second_digit, first_digit)

# if ((first_digit + last_digit) == (second_digit - third_digit)):
#     print('ДА')
# else:
#     print('НЕТ')


# .................................................................................................................................................


# age = int(input())

# if age < 18:
#     print('Доступ запрещен')
# else:
#     print('Доступ разрешен')


# .................................................................................................................................................


# a = int(input())
# b = int(input())
# c = int(input())


# if (b - a) + b == c:
#     print('YES')
# else:
#     print('NO')


# .................................................................................................................................................


# a = int(input())
# b = int(input())

# if a < b:
#     print(a)
# else:
#     print(b)


# .................................................................................................................................................


# a = int(input())
# b = int(input())
# c = int(input())
# d = int(input())

# counter_AB = 0
# counter_CD = 0

# if a < b:
#     counter_AB = a
# else:
#     counter_AB = b

# if c < d:
#     counter_CD = c
# else:
#     counter_CD = d

# if counter_AB < counter_CD:
#     print(counter_AB)
# else:
#     print(counter_CD)


# .................................................................................................................................................


# age = int(input())

# if age <= 13:
#     print('детство')
# elif 14 <= age <= 24:
#     print('молодость')
# elif 25 <= age <= 59:
#     print('зрелость')
# elif age >= 60:
#     print('старость')


# .................................................................................................................................................


# a = int(input())
# b = int(input())
# c = int(input())

# if a < 0:
#     a = 0
# if b < 0:
#     b = 0
# if c < 0:
#     c = 0

# print(a + b + c)


# .................................................................................................................................................


# a = int(input())

# if -1 < a < 17:
#     print('Принадлежит')
# else:
#     print('Не принадлежит')


# .................................................................................................................................................


# a = int(input())

# if a <= -3 or a >= 7:
#     print('Принадлежит')
# else:
#     print('Не принадлежит')


# .................................................................................................................................................


# a = int(input())

# if -30 < a <= -2 or 7 < a <= 25:
#     print('Принадлежит')
# else:
#     print('Не принадлежит')


# .................................................................................................................................................


# a = int(input())

# if 1000 < a < 9999 and (a % 7 == 0 or a % 17 == 0):
#     print('YES')
# else:
#     print('NO')

# .................................................................................................................................................


# a = int(input())
# b = int(input())
# c = int(input())


# if (a + b > c) and (a + c > b) and (b + c > a):
#     print('YES')
# else:
#     print('NO')


# .................................................................................................................................................


# year = int(input())

# if (year % 4 == 0 and year % 100 != 0) or year % 400 == 0:
#     print('YES')
# else:
#     print('NO')


# .................................................................................................................................................


# a = int(input())
# b = int(input())
# c = int(input())
# d = int(input())

# # a_b = int(str(a) + str(b))
# # c_d = int(str(c) + str(d))


# if a == c or b == d:
#     print('YES')
# else:
#     print('NO')


# .................................................................................................................................................


# a = int(input())
# b = int(input())
# c = int(input())
# d = int(input())

# x_line = a - c
# y_line = b - d

# if (-1 <= x_line <= 1) and (-1 <= y_line <= 1):
#     print("YES")
# else:
#     print("NO")


# .................................................................................................................................................

# n = int(input())
# k = int(input())

# if n == k:
#     print("Don't know")
# elif n > k:
#     print("NO")
# else:
#     print("YES")


# .................................................................................................................................................


# a = int(input())
# b = int(input())
# c = int(input())


# if a != b and b != c and a != c:
#     print("Разносторонний")
# elif a == b == c:
#     print("Равносторонний")
# else:
#     print("Равнобедренный")


# .................................................................................................................................................


# a = int(input())
# b = int(input())
# c = int(input())


# if a < b < c or c < b < a:
#     print(b)
# elif b < a < c or c < a < b:
#     print(a)
# else:
#     print(c)


# .................................................................................................................................................


# a = int(input())

# if a == 2:
#     print(28)
# elif a in (4, 6, 9, 11):
#     print(30)
# else:
#     print(31)


# .................................................................................................................................................


# a = int(input())

# if a < 60:
#     print('Легкий вес')
# elif 60 <= a < 64:
#     print('Первый полусредний вес')
# else:
#     print('Полусредний вес')


# .................................................................................................................................................


# a, b = int(input()), int(input())

# str = input()


# if str not in ("+", "-", "*", "/"):
#     print("Неверная операция")
# elif str == "+":
#     print(a + b)
# elif str == "-":
#     print(a - b)
# elif str == "*":
#     print(a * b)
# elif str == "/" and (b != 0):
#     print(a / b)
# else:
#     print("На ноль делить нельзя!")


# .................................................................................................................................................


# firstColor, secondColor = input(), input()


# if firstColor not in ('красный', 'синий', 'желтый') or secondColor not in ('красный', 'синий', 'желтый'):
#     print('ошибка цвета')
# elif firstColor == 'красный' and secondColor == 'синий' or firstColor == 'синий' and secondColor == 'красный':
#     print('фиолетовый')
# elif firstColor == 'красный' and secondColor == 'желтый' or firstColor == 'желтый' and secondColor == 'красный':
#     print('оранжевый')
# elif firstColor == 'синий' and secondColor == 'желтый' or firstColor == 'желтый' and secondColor == 'синий':
#     print('зеленый')
# else:
#     print(firstColor)


# .................................................................................................................................................


# a = int(input())

# if not 0 <= a <= 36:
#     print('ошибка ввода')
# elif a == 0:
#     print('зеленый')
# elif 1 <= a <= 10:
#     if a % 2 == 0:
#         print('черный')
#     else:
#         print('красный')
# elif 11 <= a <= 18:
#     if a % 2 == 0:
#         print('красный')
#     else:
#         print('черный')
# elif 19 <= a <= 28:
#     if a % 2 == 0:
#         print('черный')
#     else:
#         print('красный')
# elif 29 <= a <= 36:
#     if a % 2 == 0:
#         print('красный')
#     else:
#         print('черный')


# .................................................................................................................................................


# a, b, c, d = int(input), int(input), int(input), int(input)


# if a == c:
#     print(a)
# elif b == d:
#     print(b)
# elif b < c or d < a:
#     print("пустое множество")
# elif a <= c < b < d:
#     print(c, b)
# elif c <= a < d < b:
#     print(a, c)
# elif a < c < d <= b:
#     print(c, d)
# else:
#     print(a, b)


# .................................................................................................................................................
# EXAMS TASKS ABOUT CONDITIONAL OPERATIONS

# a = int(input())


# if a % 100 == 0:
#     print('YES')
# else:
#     print('NO')


# .................................................................................................................................................


# a1, b1, a2, b2 = int(input()), int(input()), int(input()), int(input())


# if (a1 + b1 + a2 + b2) % 2 == 0:
#     print('YES')
# else:
#     print('NO')


# .................................................................................................................................................


# age = int(input())
# gender = input()

# if 10 <= age <= 15 and gender == 'm':
#     print('NO')
# elif 10 <= age <= 15 and gender == 'f':
#     print('YES')
# else:
#     print('NO')


# .................................................................................................................................................


# num = int(input())

# if num == 1:
#     print('I')
# elif num == 2:
#     print('II')
# elif num == 3:
#     print('III')
# elif num == 4:
#     print('IV')
# elif num == 5:
#     print('V')
# elif num == 6:
#     print('VI')
# elif num == 7:
#     print('VII')
# elif num == 8:
#     print('VIII')
# elif num == 9:
#     print('IX')
# elif num == 10:
#     print('X')
# else:
#     print('ошибка')


# .................................................................................................................................................


# num = int(input())


# if num % 2 != 0:
#     print('YES')
# elif num % 2 == 0 and 2 <= num <= 5:
#     print('NO')
# elif num % 2 == 0 and 6 <= num <= 20:
#     print('YES')
# elif num % 2 == 0 and num > 20:
#     print('NO')


# .................................................................................................................................................


# a1, b1, a2, b2 = int(input()), int(input()), int(input()), int(input())


# if a1 + b1 == a2 + b2 or a2 + b2 == a1 + b1:
#     print('YES')
# elif a1 - b1 == a2 - b2:
#     print('YES')
# else:
#     print('NO')


# .................................................................................................................................................

# a1, b1, a2, b2 = int(input()), int(input()), int(input()), int(input())


# if (a1 + 2 == a2 and b1 + 1 == b2) or (a1 + 2 == a2 and b1 - 1 == b2):
#     print('YES')
# elif (a1 + 1 == a2 and b1 - 2 == b2) or (a1 + 1 == a2 and b1 + 2 == b2):
#     print('YES')
# elif (a1 - 1 == a2 and b1 - 2 == b2) or (a1 - 1 == a2 and b1 + 2 == b2):
#     print('YES')
# elif (a1 - 2 == a2 and b1 - 1 == b2) or (a1 - 2 == a2 and b1 + 1 == b2):
#     print('YES')
# else:
#     print('NO')


# .................................................................................................................................................


# a1, b1, a2, b2 = int(input()), int(input()), int(input()), int(input())

# if a1 + b1 == a2 + b2 or a2 + b2 == a1 + b1:
#     print('YES')
# elif a1 - b1 == a2 - b2:
#     print('YES')
# elif a1 == a2 or b1 == b2:
#     print('YES')
# elif a1 == a2 and (b1 - 1 == b2 or b1 + 1 == b2):
#     print('YES')
# elif b1 == b2 and (a1 - 1 == a2 or a1 + 1 == a2):
#     print('YES')
# elif (a1 + 1 == a2 and b1 - 1 == b2) or (a1 - 1 == a2 and b1 + 1 == b2):
#     print('YES')
# elif (a1 + 1 == a2 and b1 + 1 == b2) or (a1 - 1 == a2 and b1 - 1 == b2):
#     print('YES')
# else:
#     print('NO')
