# s = '01234567891011121314151617'
# for i in range(0, len(s), 5):
#     print(s[i], end='')
#
#
# b = 'In 2010'
#
# print(len(b))
# from numbers import Number

#
# example_word = input('Enter a word: ')
#
# for i in range(len(example_word)):
#     if i % 2 == 0:
#         print(example_word[i])

# .................................................................................................................................................


# a = input()
#
# for i in range(-1, -len(a) - 1, -1):
#     print(a[i])

# .................................................................................................................................................

# name = input("What is your name? ")
# surname = input("What is your surname? ")
# father_name = input("What is your father's name? ")
#
# print(surname[0], name[0], father_name[0], sep='')


# .................................................................................................................................................

#
# string_number = input()
# sum_int = 0
#
# for i in range(0,len(string_number)):
#     sum_int = sum_int + int(string_number[i])
# print(sum_int)


# .................................................................................................................................................


# word = input()
# count = 0
#
# for i in range(len(word)):
#     if word[i] in '0123456789':
#         count += 1
#
# if count > 0:
#     print('Цифра')
# else:
#     print('Цифр нет')


# .................................................................................................................................................

# word = input()
# multiply_count = 0
# sum_count = 0
#
# for i in range(len(word)):
#     if word[i] in '*':
#         multiply_count += 1
#     elif word[i] in '+':
#         sum_count += 1
#
# print('Символ + встречается', sum_count, 'раз')
# print('Символ * встречается', multiply_count, 'раз')


# .................................................................................................................................................

# word = input()
# count = 0
#
# for i in range(len(word) - 1):
#     if word[i] == word[i + 1]:
#         count += 1
#
# print(count)


# .................................................................................................................................................

# word = input().lower()
# count_vowels = 0
# count_spoken = 0
#
# for i in word:
#     if i in 'ауоыиэяюе':
#         count_vowels += 1
#     elif i in 'бвгджзйклмнпрстфхцчшщ':
#         count_spoken += 1
#
# print('Количество гласных букв равно',count_vowels)
# print('Количество согласных букв равно', count_spoken)


# .................................................................................................................................................


# num = int(input())
# reversed_num1 = ''
#
# while num > 0:
#     last = num % 2
#     reversed_num1 = str(last) + reversed_num1
#     num = num // 2
# print(reversed_num1)
# # last task

# .................................................................................................................................................


# word = input()
#
# if word[::] == word[::-1]:
#     print('YES')
# else:
#     print('NO')


# .................................................................................................................................................

# word = input()
#
# #1 общее количество символов в строке
# print(len(word))
#
# #2 исходную строку, повторённую 3 раза;
# for i in range(3):
#     print(word, end='')
#
# #3 первый символ строки;
# print()
# print(word[0], end='\n')
#
# #4 первые три символа строки;
#
# print(word[0:3])
#
# #5 последние три символа строки;
#
# print(word[-3:])
#
# #6 строку в обратном порядке;
#
# print(word[::-1])
#
# #7строку с удалённым первым и последним символами.
#
# print(word[1:len(word) - 1])

# .................................................................................................................................................

# третий символ этой строки;
# предпоследний символ этой строки;
# первые пять символов этой строки;
# всю строку, кроме последних двух символов;
# все символы с чётными индексами;
# все символы с нечётными индексами;
# все символы в обратном порядке;
# все символы строки через один в обратном порядке, начиная с последнего.


# word = input()
#
# print(word[2])
#
# print(word[len(word)-2])
#
# print(word[:5])
#
# print(word[:len(word)-2])
#
# print(word[::2])
#
# print(word[1::2])
#
# print(word[::-1])
#
# print(word[::-2])

# .................................................................................................................................................


# word = input()
# left_side_word = ''
# right_side_word = ''
#
# if len(word) % 2 == 0:
#     left_side_word = word[:len(word) // 2]
#     right_side_word = word[(len(word) // 2):]
#     print(right_side_word + left_side_word)
# elif len(word) % 2 == 1:
#     left_side_word = word[:(len(word) // 2) + 1]
#     right_side_word = word[(len(word) // 2) + 1:]
#     print(right_side_word + left_side_word)


# .................................................................................................................................................




